interface TeamMember {
  name: string;
  position: string;
  image: string;
  phone_number: string;
  email: string;
  instagram: string;
  telegram: string;
}

export type { TeamMember };

interface FundProgrammPurpose {
  id: number;
  title: string;
  image?: string;
}

interface FundProgrammQuestion {
  id: number;
  question: string;
  answer: string;
}

interface FundProgrammAchivments {
  mainCount: string;
  mainAdditionalDescription: string;
  mainDescription: string;
  fundraisingTitle: string;
  fundraisingDescription: string;
}

interface FundProgramm {
  id: number;
  headerTitle: string;
  headerDescription: string[];
  headerImage: string;

  detailsAboutProgramm: string[];
  currentProgrammInfo: string;
  currentProgrammImage: string;

  previewImage: string;

  fundProgrammPurpose: FundProgrammPurpose[];

  questions?: FundProgrammQuestion[];

  achivments?: FundProgrammAchivments;
}

export type { FundProgramm };

const fundProgrammData: FundProgramm[] = [
  {
    id: 1,
    headerTitle: 'Допомога Збройним Силам України та забезпечення національної безпеки',
    headerDescription: [
      'Метою "Допомога Збройним Силам України та забезпечення національної безпеки" - це благодійна програма благодійної організації «Європейський Фонд Допомоги» (БО "ЄФД") - Charity Organization «European Assistance Fund» (CO "EAF"), що має на меті забезпечення Збройних Сил України необхідною технікою, амуніцією та іншим.',
      'Підтримати програму ви завжди можете натиснувши кнопку "ПІДТРИМАТИ" допомогай ЗСУ!'
    ],
    headerImage: '/programm-page-header-image-1.png',
    detailsAboutProgramm: [
      '“Допомога Збройним Силам України та забезпечення національної безпеки” – це благодійна програма, що має на меті забезпечення Збройних Сил України необхідною технікою та амуніцією. Організація “Європейський Фонд Допомоги” взяла на себе збір коштів для підтримки програми.',
      'Це включає співпрацю з іншими благодійними організаціями, проведення благодійних заходів, фінансову допомогу та підтримку проектів зі створення та вдосконалення технологій військового захисту. ',
      'Громадяни, корпорації та інші благодійні організації можуть приєднатися до цієї програми та допомогти Збройним Силам України в захисті національної безпеки.'
    ],
    currentProgrammInfo: 'Програма “Допомога Збройним Силам України” забезпечує їх технікою та амуніцією. “Європейський Фонд Допомоги” збирає кошти, співпрацює з іншими організаціями та проводить заходи для підтримки.',
    currentProgrammImage: '/programm-page-current-programm-image-1.png',
    
    previewImage: '/program-img-1.png',

    fundProgrammPurpose: [
      {
        id: 1,
        title: 'Придбання та передача військової техніки та обладнання (автомобілів, дронів, інших засобів спостереження, захисту та зв\'язку) Збройним Силам України для підвищення їх ефективності та безпеки виконання завдань.',
      },
      {
        id: 2,
        title: 'Надання фінансової допомоги Збройним Силам України для забезпечення їх потреб у технічному забезпеченні, запасах палива та іншої амуніції.',
      },
      {
        id: 3,
        title: 'Проведення благодійних заходів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може організовувати благодійні заходи, такі як концерти, аукціони тощо, для збору коштів та підвищення уваги до потреб ЗСУ. Проведення благодійних акцій зі збору коштів на потреби Збройних Сил України, які можуть включати забезпечення воїнів необхідними речами.',
        image: '/programm-page-purpose-image-1-3.png'
      },
      
      {
        id: 4,
        title: 'Співпраця з іншими благодійними організаціями: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може співпрацювати з іншими благодійними організаціями, щоб збирати кошти та надавати допомогу ЗСУ.',
        image: '/programm-page-purpose-image-1-4.png'
      },
      
      {
        id: 5,
        title: 'Співпраця з іншими благодійними організаціями: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може співпрацювати з іншими благодійними організаціями, щоб збирати кошти та надавати допомогу ЗСУ.',
      },
      
      {
        id: 6,
        title: 'Співпраця з іншими благодійними організаціями: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може співпрацювати з іншими благодійними організаціями, щоб збирати кошти та надавати допомогу ЗСУ.',
      },
    ],

    questions: [
      {
        id: 1,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 2,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 3,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 4,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 5,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 6,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 7,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
    ],

    achivments: {
      mainCount: '5+',
      mainAdditionalDescription: 'Напрямків допомоги військовим',
      mainDescription: 'Для ефективного підсилення Сил оборони країни',
      fundraisingTitle: 'Збір коштів триває',
      fundraisingDescription: 'Долучайтесь до допомоги Збройним Силам України',
    },
  },

  {
    id: 2,
    headerTitle: 'Надання гуманітарної допомоги жертвам війни та стихійних лих',
    headerDescription: [
      'Програма благодійної організації «Європейський Фонд Допомоги» (БО "ЄФД") - Charity Organization «European Assistance Fund» (CO "EAF"). Наша мета об\'єднати ресурси активних небайдужих людей для вирішення соціальних проблем що потребують допомоги. Приєднуйся до нас!',
      'Підтримати програму ви завжди можете натиснувши кнопку "ПІДТРИМАТИ" допомогай ЗСУ!'
    ],
    headerImage: '/programm-page-header-image-2.png',
    detailsAboutProgramm: [
      'Наша благодійна організація “Європейський Фонд Допомоги” на чолі з Ніконоровим Антоном Сергійовичем  знаходиться на передовій допомоги людям, які стали жертвами трагічних подій. Ми маємо волонтерів у різних куточках світу та намагаємося надати допомогу кожному, хто потребує її найбільше.',
      'Враховуючи широкий спектр ситуацій, з якими можуть зіткнутися люди, наш фонд зосереджується на тому, щоб допомагати тим, хто втратив будинки, близьких, потерпів від насильства чи стихійних лих. Ми знаємо, як важко знайти вихід з таких складних ситуацій, тому кожну заявку ми обробляємо вручну, визначаючи найбільш ефективний спосіб допомоги.',
      'Наш фонд неодноразово співпрацював з місцевими організаціями, щоб забезпечити найкращу можливу допомогу людям у потребі. Крім того, ми постійно вдосконалюємо наші стратегії допомоги, щоб бути ще більш ефективними у наданні допомоги.',
      'Ми віримо, що важкі ситуації, з якими зіткнулися люди, можуть викликати найкращі риси людської природи – співчуття, підтримку та взаємодопомогу. Тому наш фонд зобов’язаний допомагати тим, хто найбільше цього потребує, і підтримувати розвиток громадського та волонтерського рухів у світі.'
    ],
    currentProgrammInfo: 'Наш фонд допомагає людям, які втратили будинки або постраждали від насильства. Співпрацюємо з місцевими організаціями для надання підтримки.',
    currentProgrammImage: '/programm-page-current-programm-image-2.png',
    
    previewImage: '/program-img-2.png',
    
    fundProgrammPurpose: [
      {
        id: 1,
        title: 'Надання допомоги людям, які потребують підтримки внаслідок надзвичайних ситуацій, таких як війни, стихійні лиха, аварії, пожежі і міжособистісне насильство.',
      },
      {
        id: 2,
        title: 'Підтримка переміщених людей, сімей та спільнот, які втратили свої будинки, близьких та звичне оточення.',
      },
      {
        id: 3,
        title: 'Полегшення процесу отримання допомоги шляхом обробки залишених заявок вручну для більш ефективного пошуку виходу з надзвичайних ситуацій.',
      },
      {
        id: 4,
        title: 'Збільшення ресурсів співчуття, підтримки та взаємодопомоги в громаді шляхом залучення волонтерів та підтримки волонтерського руху.',
      },
      {
        id: 5,
        title: 'Збільшення ресурсів співчуття, підтримки та взаємодопомоги в громаді шляхом залучення волонтерів та підтримки волонтерського руху.',
      },
      {
        id: 6,
        title: 'Сприяння співпраці з іншими організаціями та установами, які займаються наданням допомоги в надзвичайних ситуаціях, з метою покращення координації та ефективності допомоги.',
      },
      {
        id: 7,
        title: 'Підтримка проектів, спрямованих на запобігання надзвичайним ситуаціям та зменшення їх наслідків, таких як проекти з протидії пожежам, зменшення ризиків повеней, або проекти зі створення системи попередження про надзвичайні ситуації.',
      },
      {
        id: 8,
        title: 'Збір коштів на підтримку постраждалих від надзвичайних ситуацій та реалізацію проектів з попередження надзвичайних ситуацій. Кошти можуть збиратись через різні канали, такі як благодійні концерти, онлайн-збір коштів, аукціони тощо. Кошти, зібрані за допомогою цієї програми, можуть використовуватися для придбання матеріальної допомоги, медичного обладнання, будівництва житла для постраждалих тощо.',
        image: '/programm-page-purpose-image-2-8.png'
      },
    ],

    questions: [
      {
        id: 1,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 2,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 3,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 4,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 5,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 6,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
      {
        id: 7,
        question: 'Інформаційна підтримка',
        answer: 'Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.',
      },
    ],

    achivments: {
      mainCount: '2,643+',
      mainAdditionalDescription: 'Гуманітарної допомоги ми передали',
      mainDescription: 'Передано гуманітарної допомоги сім\'ям',
      fundraisingTitle: 'Збір коштів триває',
      fundraisingDescription: 'Долучайтесь до допомоги постраждалим від війни та слихійних лих',
    },
  },

  {
    id: 3,
    headerTitle: 'Підтримка організацій спортивних заходів',
    headerDescription: [
      'Програма благодійної організації «Європейський Фонд Допомоги» (БО "ЄФД") - Charity Organization «European Assistance Fund» (CO "EAF").',
      'Основна мета програми "Підтримка організацій спортивних заходів" полягає у наданні фінансової, організаційної та інформаційної підтримки організаторам спортивних заходів на різних рівнях - від місцевих до національних.',
      'Програма спрямована на підвищення рівня розвитку спорту в країні, просування здорового способу життя та виховання молоді в дусі здорового спортивного конкурентного духу.'
    ],
    headerImage: '/programm-page-header-image-3.png',
    detailsAboutProgramm: [
      'Наша програма “Фізичне виховання для здорового життя” є передовим кроком у напрямку виховання в людей свідомості про важливість здорового способу життя. Наш пріоритет – створення умов для забезпечення кожної людини необхідними науковими знаннями про здоров’я і методами його зміцнення',
      'Ми зосереджуємось на розвитку різноманітних форм спорту та фізичної культури, які є доступними для різних груп населення, та забезпеченні їх матеріально-технічною та інформаційною підтримкою.',
      'Наш фонд працює над розробкою та впровадженням ефективних методів протидії хворобам, збільшення працездатності та тривалої творчої активності. Ми прагнемо залучити якомога більше людей до регулярних занять фізичною культурою та спортом, щоб кожен зміг знайти свій шлях до здорового і активного способу життя.',
      'З нами ви отримаєте необхідні знання та підтримку для досягнення ваших фізичних та моральних цілей. Будьте здорові і успішні разом з нами!',
      'Основна мета програми “Підтримка організацій спортивних заходів” полягає у наданні фінансової, організаційної та інформаційної підтримки організаторам спортивних заходів на різних рівнях – від місцевих до національних. Програма спрямована на підвищення рівня розвитку спорту в країні, просування здорового способу життя та виховання молоді в дусі здорового спортивного конкурентного духу.'
    ],
    currentProgrammInfo: 'Програма “Фізичне виховання” виховує свідомість про здоровий спосіб життя. Ми створюємо умови для наукових знань про здоров’я та підтримуємо різні групи населення.',
    currentProgrammImage: '/programm-page-current-programm-image-3.png',
    
    previewImage: '/program-img-3.png',
    
    fundProgrammPurpose: [
      {
        id: 1,
        title: 'Організаційна підтримка організаторів спортивних заходів, включаючи допомогу в плануванні та реалізації подій.',
      },
      {
        id: 2,
        title: 'Поширення інформації про спортивні заходи та їхніх організаторів для забезпечення широкого охоплення.',
      },
      {
        id: 3,
        title: 'Сприяння популяризації спорту та здорового способу життя серед населення, зокрема серед молоді.',
      },
      {
        id: 4,
        title: 'Розвиток інфраструктури спортивних заходів, зокрема створення спортивних майданчиків та іншої необхідної інфраструктури для проведення змагань.',
      },
      {
        id: 5,
        title: 'Взаємодія з державними та іншими організаціями, спрямованими на розвиток фізичної культури та спорту в Україні.',
      },
      {
        id: 6,
        title: 'Проведення благодійних заходів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може організовувати благодійні заходи, такі як концерти, аукціони тощо, для збору коштів для спортивних змагань та інших заходів.',
      },
      {
        id: 7,
        title: 'Співпраця з іншими благодійними організаціями: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може співпрацювати з іншими благодійними організаціями, для подальшого надання фінансової підтримки для проведення спортивних змагань та інших заходів.',
      },
      {
        id: 8,
        title: 'Забезпечення ефективного використання отриманих коштів та матеріально-технічних ресурсів для забезпечення якісної організації спортивних заходів.',
      },
      {
        id: 9,
        title: 'Збір коштів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може збирати кошти від громадян, корпорацій та інших благодійних організацій для подальшого надання фінансової підтримки для проведення спортивних змагань та інших заходів.',
        image: '/programm-page-purpose-image-3-9.png'
      },
    ]
  },

  {
    id: 4,
    headerTitle: 'Забезпечення розширення освітніх можливостей та доступності інформаційних технологій',
    headerDescription: [
      'Програма благодійної організації «Європейський Фонд Допомоги» (БО "ЄФД") - Charity Organization «European Assistance Fund» (CO "EAF"). Основна мета програми "Забезпечення розширення освітніх можливостей та доступності інформаційних технологій" - забезпечення можливості здобуття якісної освіти та доступності інформаційних технологій для всіх верств населення, зокрема тих, хто знаходиться у складних життєвих обставинах, має обмежений доступ до освіти та інформації, а також дітей та молоді.',
      'Програма має на меті зменшення соціальних розбіжностей, забезпечення рівних можливостей для отримання якісної освіти та підвищення рівня інформаційної грамотності українського населення.'
    ],
    headerImage: '/programm-page-header-image-4.png',
    detailsAboutProgramm: [
      'Основна мета програми “Забезпечення розширення освітніх можливостей та доступності інформаційних технологій” – забезпечення можливості здобуття якісної освіти та доступності інформаційних технологій для всіх верств населення, зокрема тих, хто знаходиться у складних життєвих обставинах, має обмежений доступ до освіти та інформації, а також дітей та молоді.',
      'Програма має на меті зменшення соціальних розбіжностей, забезпечення рівних можливостей для отримання якісної освіти та підвищення рівня інформаційної грамотності населення.',
      'Освіта – основа розвитку особистості, суспільства, нації та держави. Вона є визначальним чинником політичної, соціально-економічної, культурної та наукової життєдіяльності суспільства. Освіта відтворює і нарощує інтелектуальний, духовний та економічний потенціал суспільства',
      'Освіта є стратегічним ресурсом поліпшення добробуту людей, забезпечення національних інтересів, зміцнення авторитету і конкурентоспроможності людини. Пріоритетом розвитку освіти є впровадження сучасних інформаційно комунікаційних технологій, що забезпечують удосконалення навчально - виховного процесу, доступність та ефективність освіти, підготовку молодого покоління до життєдіяльності в інформаційному суспільстві.',
      'Завдяки нашій співпраці з низкою компаній, які сприяють розвитку інформаційних технологій, ми беремо активну участь у підвищенні рівня освіти людини, підтримуючи проекти від наших однодумців як фінансово, так і інформаційно.'
    ],
    currentProgrammInfo: 'Мета програми “Забезпечення розширення освітніх можливостей” – забезпечити якісну освіту та доступність технологій. Програма зменшує соціальні розбіжності та підвищує грамотність.',
    currentProgrammImage: '/programm-page-current-programm-image-4.png',
    
    previewImage: '/program-img-4.png',
    
    fundProgrammPurpose: [
      {
        id: 1,
        title: 'Організація онлайн-курсів з різних предметів та професійних навичок. Ми будемо залучати висококваліфікованих викладачів та експертів для створення та проведення цих курсів.',
      },
      {
        id: 2,
        title: 'Організація курсів та тренінгів з використанням інформаційних технологій для людей з обмеженими можливостями.',
      },
      {
        id: 3,
        title: 'Розширення доступу до комп\'ютерних класів та інтернету для шкіл та інших освітніх закладів.Ми будемо забезпечувати установку необхідного обладнання та програмного забезпечення, а також проводити навчання вчителів та учнів з питань використання комп\'ютерів та Інтернету.',
      },
      {
        id: 4,
        title: 'Сприяння створенню та підтримці доступної інформаційної бази для людей з обмеженими можливостями та інших соціально вразливих груп.',
      },
      {
        id: 5,
        title: 'Сприяння створенню та підтримці доступу до Інтернету в закладах освіти та громадських місцях.',
      },
      {
        id: 6,
        title: 'Організація конкурсів та заходів, спрямованих на популяризацію використання інформаційних технологій у навчальному процесі та житті кожної людини.',
      },
      {
        id: 7,
        title: 'Збір коштів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може збирати кошти від громадян, корпорацій та інших благодійних організацій для подальшого надання фінансової підтримки програми.',
        image: '/programm-page-purpose-image-4-7.png'
      },
      {
        id: 8,
        title: 'Збір коштів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може збирати кошти від громадян, корпорацій та інших благодійних організацій для подальшого надання фінансової підтримки програми.',
        image: '/programm-page-purpose-image-4-8.png'
      },
      {
        id: 9,
        title: 'Збір коштів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може збирати кошти від громадян, корпорацій та інших благодійних організацій для подальшого надання фінансової підтримки програми.',
      },
      {
        id: 10,
        title: 'Збір коштів: Благодійна Організація «Європейський Фонд Допомоги» (БО "ЄФД") може збирати кошти від громадян, корпорацій та інших благодійних організацій для подальшого надання фінансової підтримки програми.',
      },
    ]
  },
]

export { fundProgrammData };

interface PublicOfferData {
  title?: string;
  description: string[];
}

export type { PublicOfferData };

export const publicOfferData: PublicOfferData[] = [
  {
    description: [
      'Ця Публічна оферта про надання пожертвувань у благодійних цілях (надалі – Оферта) спрямована на невизначене коло фізичних осіб (надалі – Благодійник), які є відвідувачами офіційного сайту благодійної організації «Європейський Фонд Допомоги» (надалі – «Організація») у мережі інтернет за посиланням https://eaf.fund/ (надалі – «Сайт») та бажають здійснити благодійну пожертву у розумінні даної публічної оферти (надалі – Договір благодійної пожертви), разом за текстом Оферти іменуються «Сторони», а кожен окремо – «Сторона».',
      'Текст Оферти є офіційною пропозицією благодійної організації «Європейський Фонд Допомоги», в особі голови благодійної організації Ніконорова Антона Сергійовича, який діє на підставі Статуту, укласти договір про благодійну пожертву (надалі – «Договір»), суть якого викладена нижче.',
    ],
  },

  {
    title: '1. Визначення та поняття.',
    description: [
      '1.1. Публічна оферта – чинна пропозиція Організації, розміщена на Сайті, про надання благодійного пожертвування, адресована до необмеженого кола осіб, у тому числі Благодійника.',
      '1.2. Акцепт – повне і безумовне прийняття Публічної оферти шляхом вчинення дій щодо здійснення грошового переказу за допомогою платіжних форм та засобів, розміщених на Сайті, а також шляхом перерахування грошових коштів на розрахунковий рахунок Організації через установи банків. Моментом Акцепту є дата зарахування коштів на банківський розрахунковий рахунок Організації.',
      '1.3. Благодійна пожертва – безоплатна передача Благодійником засобів у власність Організації для досягнення певних, заздалегідь обумовлених цілей діяльності, відповідно до Договору та Закону України «Про благодійну діяльність та благодійні організації».',
    ],
  },

  {
    title: '2. Предмет договору.',
    description: [
      '2.1. Предметом цього договору є безоплатна і добровільна передача від Благодійника до Організації грошових коштів, шляхом здійснення добровільних пожертвувань для реалізації статутних цілей та діяльності Організації, а також щодо надання Організацією благодійної допомоги відповідно до Закону України «Про благодійну діяльність та благодійні організації», програм Фонду.',
      '2.2. Обсяг та розмір благодійних пожертвувань Благодійник визначає самостійно на власний розсуд.',
      '2.3. Виконання сторонами умов Оферти не має на меті отримання прибутку або будь-яких благ для жодної із сторін.',
      '2.4. Сторони підтверджують, що отримання прибутку (прямо чи опосередковано) Сторонами не є предметом Оферти.',
      '2.5. Прийняття Благодійником цієї Публічної оферти здійснюється шляхом сплати Благодійної пожертви.',
    ],
  },

  {
    title: '3. Акцепт Оферти.',
    description: [
      '3.1. Акцепт Оферти (прийняття умов Оферти) означає, що Благодійник згоден з усіма його положеннями, він ознайомлений зі Статутом Організації, який розміщений в електронному вигляді на Сайті Організації, він повною мірою усвідомлює і згоден з предметом Договору, з метою та цілями публічного збору благодійних пожертв і з правом Організації використовувати частину Благодійної пожертви Благодійника на адміністративні витрати Організації, в розмірі не більшому, ніж це передбачено законодавством України.',
      '3.2. Благодійник і Організація, керуючись ст. 207, ч. 2 ст. 639, ст. 641, 642 Цивільного кодексу України, погоджуються, що з моменту Акцепту Оферти Договір благодійної пожертви вважається укладеним.',
      '3.3. Сторони погоджуються, що недодержання Сторонами письмової форми Договору благодійної пожертви, не означає його недійсність.',
    ],
  },

  { 
    title: '4. Права та обов’язки Організації.',
    description: [
      '4.1. Організація має право:',
      '4.1.1. Отримувати Благодійні пожертви і використовувати їх відповідно до умов Оферти та Договору благодійної пожертви.',
      '4.1.2. Змінювати напрямки використання благодійної пожертви в межах Статутної діяльності Організації.',
      '4.1.3. Використовувати частину Благодійного пожертви на адміністративні витрати Організації, без погодження з Благодійником, у розмірі не більшому, ніж це передбачено законодавством України.',
      '4.2. Організація зобов’язана:',
      '4.2.1. Створити умови необхідні Благодійнику для внесення Благодійної пожертви згідно умов Оферти.',
      '4.2.2. Використовувати отримані благодійні пожертви для досягнення цілей, передбачених Статутом Організації.',
      '4.2.3. Зберігати конфіденційну інформацію (в т.ч. персональні дані), отриману від Благодійника, не передавати її третім особам без згоди Благодійника, за винятком випадків, встановлених Офертою і чинним законодавством України.',
    ],
  },
  
  {
    title: '5. Права та обов’язки Благодійника.',
    description: [
      '5.1. Благодійник має право:',
      '5.1.1. Перерахувати добровільну благодійну пожертву на рахунок Організації у спосіб зазначений у Договорі.',
      '5.1.2. Звернутися до Організації з метою отримання звіту щодо використання Організацією благодійних пожертвувань.',
      '5.2. Благодійник зобов’язаний:',
      '5.2.1. Детально та уважно ознайомитися з усіма правилами та умовами Оферти й прийняти їх при здійсненні оплати благодійної пожертви, а також всіма додатковими правилами, що регулюють відносини Сторін відповідно до Оферти.',
    ],
  },
  
  {
    title: '6. Місце та строки отримання благодійних пожертв.',
    description: [
      '6.1. Публічний збір пожертв проводиться на території будь-якої з країн світу у порядку, передбаченому ст. 7 Закону України «Про благодійну діяльність та благодійні організації». Безпосередня діяльність Організації, що стосується публічного збору пожертв за Договором, проводиться за місцезнаходженням Організації.',
      '6.2. Публічний збір пожертвувань триває до моменту ліквідації Організації, якщо інший термін не буде визначений Організацією.',
    ],
  },
  
  {
    title: '7. Порядок здійснення благодійної пожертви.',
    description: [
      '7.1. Організація забезпечує Благодійнику можливість сплати Благодійної пожертви електронним платежем на Сайті, шляхом переказу грошових коштів на банківський рахунок Організації (через платіжний сервіс LiqPay). Благодійник на власний вибір обирає формат платежу: одноразовий або регулярний (з можливістю скасувати регулярні платежі в будь-який час).',
      '7.2. Платіж визнається вчиненим Благодійником у момент підтвердження успішної транзакції з боку банку або платіжної системи. Всі витрати по сплаті сум, пов’язаних з перерахуванням пожертвування, несе Благодійник.',
      '7.3. Благодійна пожертва, сплачена Благодійником, не підлягає поверненню за жодних обставин.',
    ],
  },
  
  {
    title: '8. Порядок використання благодійних пожертвувань:',
    description: [
      '8.1. Використання зібраних за Договором Благодійних пожертв проводиться у відповідності з цілями статутної діяльності Організації. Організація розпоряджається Благодійними пожертвами на власний розсуд. Отримані Організацією Благодійні пожертви не повертаються. Відповідальність сторін за порушення умов цього Договору або порядку використання Благодійних пожертв передбачено вимогами чинного законодавства України.',
      '8.2. Благодійник або уповноважені ним особи мають право здійснювати контроль за цільовим використанням Благодійної пожертви.',
      '8.3. Порядок загального доступу до фінансових звітів Організації:',
      'Доступ до звітів Організації здійснюється шляхом звернення до Організації за електронною адресою help@eaf.fund, вказаною на сайті https://eaf.fund/. Інша інформація представляється Організацією у порядку і в терміни, передбачені законодавством України.',
    ],
  },

  {
    title: '9. Заключні положення.',
    description: [
      '9.1. У разі невиконання або неналежного виконання своїх зобов’язань, передбачених Офертою, Сторони несуть відповідальність відповідно до чинного законодавства України та умов цієї Оферти.',
      '9.2. Організація не несе відповідальності в разі вчинення дії/бездіяльності третіх осіб, внаслідок яких Організація не змогла виконати свої зобов’язання за Офертою.'
    ],
  },

  {
    title: '10. Додаткові умови.',
    description: [
      '10.1. Благодійник, шляхом здійснення Акцепту підтверджує, що він ознайомлений і дає згоду щодо збору та обробки персональних даних.',
      '10.2. Організація здійснює збір і обробку персональних даних Благодійника в цілях виконання своїх зобов’язань відповідно до Оферти та відповідно до Закону України «Про захист персональних даних».',
      '10.3. Благодійник згоден з тим, що після внесення інформації про себе під час здійснення Благодійної пожертви, підписки на новини Організації на Сайті, йому можуть направлятися звіти про результати публічних зборів та використання благодійних пожертв Організацією, листи та повідомлення, у тому числі рекламного характеру.',
      '10.4. Організація зобов’язується не передавати електронну адресу та іншу інформацію про благодійників третім особам за виключенням випадків передбачених діючим законодавством України.',
      '10.5. Організація не несе відповідальності за розголошення персональних даних, що відбулися внаслідок незаконних дій третіх осіб або у випадку якщо таке розголошення відбулося за згодою Благодійника.',
    ],
  },

  {
    title: '11. Строк дії Оферти. Порядок внесення змін та доповнень',
    description: [
      '11.1. Публічна оферта набуває чинності з моменту її розміщення на Сайті і діє до моменту ліквідації Організації, якщо інший термін не буде визначений Організацією. Положення цього пункту поширюються і на доповнення (зміни) до Оферти.',
      '11.2. Організація має право змінювати умови Публічної оферти без згоди Благодійника. Організація залишає за собою право в односторонньому порядку змінити умови Оферти в будь-який час, без будь-яких обмежень, шляхом опублікування нової редакції Оферти на Сайті.',
      '11.3. Благодійник зобов’язаний самостійно відстежувати зміни умов Оферти шляхом ознайомлення з чинною новою (актуальною) редакцією на Сайті.',
    ],
  },

  {
    title: '12. Порядок вирішення спорів',
    description: [
      '12.1. Спори та суперечки, що виникають при виконанні Договору благодійної пожертви укладеного на умовах Оферти, вирішуються шляхом переговорів у письмовому вигляді.',
      '12.2. Претензія подається Стороні в письмовому вигляді шляхом направлення рекомендованого листа із повідомленням про вручення, у строк не більше 10 (десяти) календарних днів з дати виникнення зауважень, що є підставою для спору чи суперечки. Претензія розглядається протягом 10 (десяти) календарних днів, що обчислюються з дня вручення її Стороні, якій її адресовано.',
      '12.3. У випадку неможливості Сторін досягти згоди під час переговорів у письмовій формі, спір що виник підлягає розгляду в порядку, передбаченому чинним законодавством України.',
      '12.4. З усіх інших питань, не передбачених цією Офертою, Сторони керуються чинним законодавством України.',
    ],
  },

  {
    title: '13. Форс-мажор',
    description: [
      '13.1. Сторони звільняються від відповідальності за невиконання або неналежне виконання обов’язків за умовами Оферти, якщо вказане невиконання є наслідком дії обставин непереборної сили та їх наслідків, а саме: пожеж, епідемій, повенів, землетрусів чи інших стихійних лих, війни і військових дій, страйку (-ів), диверсії, аварії, масового безладдя і заворушень, карантинних обмежень, актів органів державної влади або управління, міжнародних санкцій і т.д., які безпосередньо впливають на виконання Договору і виникли після його укладення. При цьому строк виконання зобов’язань за таким Договором продовжується на час дії вказаних обставин та їх наслідків.',
      '13.2. Сторона, яка не в змозі виконати свої зобов’язання за Договором у результаті дії обставин форс-мажору та їх наслідків, зобов’язана протягом 15-ти днів письмово повідомити іншу Сторону про початок або закінчення дії цих обставин, а також надати документальне підтвердження їх виникнення та наявності.',
      '13.3. Неповідомлення або несвоєчасне повідомлення про обставини форс-мажору позбавляє відповідну Сторону права посилатися на вказані обставини, як на такі, що звільняють від відповідальності. Повідомлення Організації про настання форс-мажорних обставин можливе, поміж інших, шляхом розміщення відповідної інформації на Сайті.',
      '13.4. Підтвердженням наявності та тривалості форс-мажорних обставин є довідки, видані уповноваженими органами державної влади України.',
    ],
  },

  {
    title: '14. Інформація про Організацію:',
    description: [
      'Благодійна Організація «Європейський Фонд Допомоги»',
      'Україна, 04071, місто Київ, вул.Хорива, будинок 7, квартира 1',
      'Код ЄДРПОУ 44793343',
      'IBAN UA 353052990000026007013302401',
      'в АТ КБ «ПРИВАТБАНК»',
      'МФО 305299',
      'Редакція Оферти від «29» березня 2023 року',
      'Опубліковано на Сайті від 29.03.2023',
    ],
  }
]

interface PrivacyPolicyData {
  title: string;
  description: string[];
}

export const privacyPolicyData: PrivacyPolicyData[] = [
  {
    title: '1. Терміни та визначення',
    description: [
      '1.1. «Веб-сайт» (надалі – «Сайт») – інформаційний ресурс в мережі Інтернет, який розміщений за адресою www.eaf.fund та містить текстову, графічну та іншу інформацію, яка сприймається як єдине ціле, та підтримується комплексом системних програмних засобів.',
      '1.2. «Власник Сайту» (надалі – «Власник»)',
      '1.3. «Користувач» – будь-яка фізична особа, яка коли-небудь здійснювала доступ до Сайту та досягла віку, допустимого для прийняття Угоди користувача розміщеної на Сайті та цієї Політики.',
      '1.4. «Аккаунт» – обліковий запис Користувача створений в момент авторизації на Сайті, що дозволяє Власнику ідентифікувати (авторизувати) Користувача шляхом використання облікового запису Користувача в соціальних мережах Facebook, Twitter, Instagram, Tik-Tok або Google.',
      '1.5. «Персональні дані» – відомості чи сукупність відомостей про Користувача, яка ідентифікована або може бути конкретно ідентифікована.',
      '1.6. «Послуги» (сервіси Сайту) – будь-які послуги, які пропонуються на Сайті Власника та включають у себе, але не обмежуються послугами  створення платформ для комунікації з бізнесом та нових форматів матеріалів та спецпроектів, створення та підвищення якості контенту для читачів Користувачів, галузеві спецпроекти, пряма реклама тощо.',
    ],
  },
  {
    title: '2. Збір та використання персональних даних',
    description: [
      '2.1. Використання Сайту не вимагає реєстрації та/або авторизації та безпосереднього надання персональних даних, які можуть ідентифікувати Вас, крім випадку передбаченого п. 2.2. Політики.',
      '2.2. На свій розсуд, для більшої зручності використання Сайту, Ви можете авторизуватись на Сайті шляхом використання особистого облікового запису в соціальних мережах Facebook, Twitter, Instagram, Tik-Tok або Google.',
      '2.3. При використанні Сайту ми можемо здійснювати автоматичний збір інформації, пов’язаної із використанням Вами Сайту.',
      '2.4. Ми можемо збирати, зберігати та використовувати такі типи Ваших персональних даних:',
      '2.4.1. інформацію про Ваш комп’ютер, включаючи IP-адресу, географічне розташування, тип і версію браузера та операційну систему;',
      '2.4.2. інформацію про Ваші відвідування та використання цього Сайту, включаючи джерело рефералів, тривалість відвідування, перегляд сторінок та маршрути навігації на Сайті;',
      '2.4.3. інформацію, яку Ви надаєте під час авторизації облікового запису на нашому Сайті у порядку встановленому п. 2.2. цієї Політики, наприклад, Ваше ім’я, фотографії з соціальної мережі, з якої було здійснено авторизацію, стать, день народження, стан стосунків, інтереси та хобі, деталі про освіту та дані про роботу, адреса електронної пошти, інформацію про зв’язок;',
      '2.4.4. інформацію, таку як ім’я та адреса електронної пошти, які Ви вводите для встановлення підписки на наші електронні листи та / або інформаційні бюлетені;',
      '2.4.5. інформацію, яку Ви вводите під час користування послугами на нашому Сайті;',
      '2.4.6. інформацію, яка генерується під час використання нашого Сайту, у тому числі коли, як часто та за яких обставин Ви його використовуєте;',
      '2.4.7. інформацію, що стосується транзакції, які Ви здійснюєте через наш Сайт, що включає ім’я, адресу, номер телефону, електронну адресу та дані Вашої кредитної картки;',
      '2.4.8. інформацію, яку Ви розміщуєте на нашому Сайті з метою опублікування в Інтернеті, яка включає ім’я користувача, зображення профілю та вміст Ваших публікацій;',
      '2.4.9. інформацію, що міститься в будь-яких повідомленнях, які Ви надсилаєте нам електронною поштою або через наш Сайт, включаючи його вміст та метадані;',
      '2.4.10. будь-яку іншу особисту інформацію, яку Ви надсилаєте нам.',
      '2.5. Перш ніж повідомляти нам особисту інформацію іншої особи, Ви повинні отримати згоду цієї особи як на розголошення, так і на обробку цієї особистої інформації відповідно до цієї Політики.',
      '2.6. У випадку коли Ви відвідуєте Сайт встановлюється з’єднання, здійснюється доступ до даних на Сайті і створюється log-файл. Він може містити:',
      '– дату і час доступу до Сайту;',
      '– IP-адресу, з якої здійснювався доступ до Сайту;',
      '– дані або ім’я файлу, до якого Ви звернулися на Сайті;',
      '– кількість часу, проведеного на Сайті;',
      '– назву і версію веб-браузера, Вашої операційної системи;',
      '– назву веб-сайту,  з якого Ви перейшли на Сайт.',
      'Ця інформація використовується для покращення продуктивності роботи Сайту, з міркувань безпеки, для забезпечення стабільності роботи Сайту, а також для захисту Сайту від можливих зовнішніх атак. Окрім цього, ми можемо здійснювати статистичний аналіз цих даних. Дані, що зберігаються у log-файлі не дають можливості нам ідентифікувати Вашу особу. Дані у log-файлі використовуються лише для мети вказаної у цій Політиці і не передаються третім сторонам, крім випадів передбачених п. 7.2 Політики.',
      '2.7  Ми збираємо лише ті персональні дані, які свідомо та добровільно надані Вами, як суб’єктом персональних даних в цілях використання сервісів Сайту, що відповідно до вимог чинного законодавства України є згодою суб’єкта персональних даних на обробку своїх персональних даних відповідно до сформульованої в цій Політиці мети їх обробки.',
      '2.8. Ми гарантуємо, що не будемо продавати або здавати в оренду особисті дані Користувача третім сторонам, крім випадків коли розкриття Ваших персональних даних необхідне для виконання вимог чинного законодавства України.',
      '2.9. Ми не збираємо та не обробляємо інформацію про Ваші персональні дані щодо расового або етнічного походження, політичних, релігійних або світоглядних переконань, членства в політичних партіях та професійних спілках, засуджень до кримінального покарання, а також даних, що стосуються здоров’я, статевого життя, біометричних або генетичних даних (відповідно до статті 7 Закону України «Про захист персональних даних»).',
    ],
  },
  {
    title: '3. Обробка персональних даних',
    description: [
      '3.1. Обробка і зберігання наданих персональних даних здійснюється в дата-центрах, де розміщується обладнання, що забезпечує функціонування сервісів Сайту. Надані персональні дані обробляються і можуть зберігатись в Базі персональних даних чи окремій таблиці Бази даних  Сайту.',
    ],
  },
  {
    title: '4. Мета використання персональних даних',
    description: [
      '4.1. Ми можемо використовувати Вашу персональну інформацію з метою:',
      '4.1.1. адміністрування нашого Сайту;',
      '4.1.2. персоналізації нашого Сайту для Вас;',
      '4.1.3. надання можливості користуватися послугами, доступними на нашому Сайті;',
      '4.1.4. надсилати Вам виписки, рахунки-фактури та нагадування про оплату та збирати платежі від Вас;',
      '4.1.5. надсилати Вам сповіщення електронною поштою, у випадку якщо Ви підписані на сповіщення електронною поштою;',
      '4.1.6. надсилати Вам нашу електронну розсилку, у випадку якщо Ви підписані на електронну розсилку. Також Ви можете повідомити нас у будь-який час, якщо Вам більше не потрібна електронна розсилка;',
      '4.1.7. надання третім сторонам статистичної інформації про наших користувачів (при цьому треті сторони не зможуть ідентифікувати жодного окремого користувача з цієї інформації);',
      '4.1.8. розгляд запитів та скарг, зроблених Вами або про Вас стосовно нашого Сайту;',
      '4.1.9. збереження нашого Сайту в безпеці та попередження шахрайства;',
      '4.1.10. перевірка відповідності умовам, що регулюють використання нашого Сайту (включаючи моніторинг приватних повідомлень, що надсилаються через наш Сайт приватною службою обміну повідомленнями);',
      '4.1.11. та інші види використання',
      '4.2. Якщо Ви виявили бажання надати персональну інформацію для публікації на нашому Сайті, ми опублікуємо та іншим чином використаємо цю інформацію відповідно до дозволу та/або ліцензії, які Ви надаєте нам.',
      '4.3. Ваші налаштування конфіденційності можуть використовуватися для обмеження публікації Вашої інформації на нашому Сайті та можуть бути скориговані за допомогою контролю конфіденційності на Сайті.',
      '4.4. Ми не будемо без Вашої прямої згоди надавати Вашу особисту інформацію будь-якій третій стороні для їх прямого маркетингу або будь-яких інших цілей, крім випадків передбачених чинним законодавством України.',
    ],
  },
  {
    title: '5. Термін зберігання персональних даних',
    description: [
      '5.1. Персональні дані зберігаються на термін не більше, ніж це необхідно відповідно до мети їх обробки.',
      '5.2. Після того, як Ви перестали бути Користувачем Сайту шляхом видалення свого Аккаунту на Сайті, ваші персональні дані також автоматично видаляються.',
    ],
  },
  {
    title: '6. Взаємодія сайту з іншими ресурсами',
    description: [
      '6.1. При використанні Вами сервісів, на сторінках Сайту можуть бути присутні коди інших інтернет ресурсів і третіх сторін, в результаті чого такі інтернет ресурси і треті сторони отримують Ваші дані. Ці інтернет-ресурси можуть отримувати і обробляти інформацію, про те, що Ви відвідали ці сторінки, а також іншу інформацію, яку передає Ваш браузер. Такими інтернет-ресурсами можуть бути:',
      '— системи банеропоказів (наприклад, DoubleClick for Publishers, Admixer, AdRiver та ін.);',
      '— соціальні плагіни мереж (наприклад, Discus, Facebook, Twitter, Google+, ).',
      '6.2. Використання зазначених сервісів необхідно для оперативного аналізу відвідувань Сайту, внутрішньої і зовнішньої оцінки відвідуваності Сайту, глибини переглядів, активності Користувачів. Дані, отримані від зазначених сервісів ми не зберігаємо і не обробляємо.',
      '6.3. Якщо Ви в силу будь-яких причин не бажаєте, щоб сервіси передбачені у п.6.1. Політики отримували доступ до Ваших персональних даних, Ви можете за власним бажанням вийти зі свого Аккаунту, очистити файли cookie (через свій браузер).',
    ],
  },
  {
    title: '7. Взаємодія власника з третіми сторонами стосовно персональних даних',
    description: [
      '7.1. Ми не здійснюємо передачу персональних даних третім сторонам, крім випадків, коли така передача є вимогою чинного законодавства України, на прохання суб’єкта персональних даних або в інших випадках, викладених в цій Політиці. Ми розуміємо, що особиста інформація є цінністю і невід’ємним змістом, в тому числі, особистих немайнових прав будь-якої фізичної особи, тому вживаємо всіх можливих заходів для захисту Вашої особистої інформації.',
      '7.2. Доступ до Ваших персональних даних можуть мати наші уповноважені працівники, які надали згоду на забезпечення конфіденційності персональних даних Користувачів, а також треті сторони, які надають нам послуги з підтримки і адміністрування Сайту, інші послуги, пов’язані із здійсненням Власником господарської діяльності. Наші уповноважені працівники та/або треті сторони на підставі укладених з нами договорів зобов’язуються дотримуватись усіх вимог чинного законодавства України щодо захисту персональних даних Користувачів та їх конфіденційності.',
      '7.3. На Сайті можуть бути посилання на інші веб-сайти (виключно в інформаційних цілях). При переході по посиланню на інші веб-сайти дія цієї Політики на такі сайти поширюватися не буде. У зв’язку з чим, ми рекомендуємо Вам переглядати політику в сфері конфіденційності і персональних даних кожного веб-сайту перед тим, як передавати будь-які персональні дані, за якими Вас можуть ідентифікувати.',
      '7.4. Особиста інформація, яку Ви публікуєте на нашому Сайті може бути доступною через мережу Інтернет в усьому світі. Ми не можемо запобігти використанню та нецільовому використанню такої інформації третіми сторонами в інших країнах.',
    ],
  },
  {
    title: '8. Захист персональних даних',
    description: [
      '8.1. Ми використовуємо загальноприйняті стандарти технологічного та операційного захисту інформації та персональних даних від втрати, неправильного використання, зміни або знищення, але ми не гарантуємо абсолютну захищеність від будь-яких загроз, що виникають поза межами нашого регулювання.',
      '8.2. Ми забезпечуємо застосування всіх відповідних зобов’язань щодо дотримання конфіденційності, а також технічних і організаційних заходів безпеки для запобігання несанкціонованого або незаконного розголошення або обробки такої інформації та даних, їх випадкової втрати, знищення або пошкодження.',
      '8.3. Ми маємо право поширювати персональні дані без Вашої згоди у випадку визначеному чинним законодавством України, і лише (якщо це необхідно) в інтересах національної безпеки, економічного добробуту та прав людини.',
      '8.4. Якщо Ви надали / втратили доступ до свого Аккаунту, Ви несете повну та самостійну відповідальність за дії нового Користувача при використанні ним Сайту та/або Послуг (сервісів) Сайту з Вашого Аккаунту.',
    ],
  },
  {
    title: '9. Умови доступу до персональних даних',
    description: [
      '9.1. Порядок доступу до персональних даних третіми сторонами визначається умовами згоди Користувача, наданої Власнику на обробку цих даних, або відповідно до вимог закону.',
      '9.2. Ви маєте право на одержання будь-яких відомостей про себе у будь-якого суб’єкта відносин, пов’язаних з персональними даними, за умови зазначення прізвища, ім’я та по батькові, місця проживання (місця перебування) і реквізитів документа, що посвідчує фізичну особу, яка подає запит, крім випадків, установлених чинним законодавством України.',
      '9.3. Доступ до даних про себе здійснюється безоплатно. Відстрочка доступу до своїх персональних даних не допускається. Відстрочка доступу до персональних даних третіми сторонами допускається у разі, якщо необхідні дані не можуть бути надані протягом тридцяти календарних днів з дня надходження запиту. При цьому загальний термін вирішення питань, порушених у запиті, не може перевищувати сорока п’яти календарних днів.',
      '9.4. Повідомлення про відстрочку доводиться до відома третьої особи, яка подала запит, у письмовій формі з роз’ясненням порядку оскарження такого рішення.',
      '9.5. Відмова у доступі до персональних даних допускається, у порядку визначеному чинним законодавством України, якщо доступ до них заборонено згідно із Законом України «Про захист персональних даних».',
      '9.6. Рішення про відстрочення або відмову у доступі до персональних даних може бути оскаржено до Уповноваженого Верховної Ради України з прав людини або суду.',
    ],
  },
  {
    title: '10. Ваші права, як користувача (Суб\'єкта персональних даних).',
    description: [
      '10.1. Ви, як Користувач (суб’єкт персональних даних) маєте право:',
      '1) знати про джерела збирання, місцезнаходження своїх персональних даних, мету їх обробки, місцезнаходження Власника або дати відповідне доручення щодо отримання цієї інформації уповноваженим особам, крім випадків, встановлених Законом України «Про захист персональних даних»;',
      '2) отримувати інформацію про умови надання доступу до персональних даних, зокрема інформацію про третіх сторін, яким передаються його персональні дані;',
      '3) на доступ до своїх персональних даних;',
      '4) отримувати не пізніш як за тридцять календарних днів з дня надходження запиту, крім випадків, передбачених Законом України «Про захист персональних даних», відповідь про те, чи обробляються його персональні дані, а також отримувати зміст таких персональних даних;',
      '5) пред’являти вмотивовану вимогу Власнику із запереченням проти обробки своїх персональних даних;',
      '6) пред’являти вмотивовану вимогу щодо зміни або знищення своїх персональних даних Власником, якщо ці дані обробляються незаконно чи є недостовірними;',
      '7) на захист своїх персональних даних від незаконної обробки та випадкової втрати, знищення, пошкодження у зв’язку з умисним приховуванням, ненаданням чи несвоєчасним їх наданням, а також на захист від надання відомостей, що є недостовірними чи ганьблять Вашу честь, гідність та ділову репутацію;',
      '8) звертатися із скаргами на обробку своїх персональних даних до Уповноваженого Верховної Ради України з прав людини або до суду;',
      '9) застосовувати засоби правового захисту в разі порушення чинного законодавства України про захист персональних даних;',
      '10) вносити застереження стосовно обмеження права на обробку своїх персональних даних під час надання згоди;',
      '11) відкликати згоду на обробку персональних даних;',
      '12) знати механізм автоматичної обробки персональних даних;',
      '13) на захист від автоматизованого рішення, яке має для нього правові наслідки.',
    ],
  },
  {
    title: '11. Файли Cookie.',
    description: [
      '11.1. Наш Сайт використовує файли cookie. Файл cookie – це файл, що містить ідентифікатор (рядок літер та цифр), який веб-сервер надсилає веб-браузеру та зберігає браузер. Потім ідентифікатор надсилається назад на сервер кожного разу, коли браузер вимагає від сервера сторінки. Файли cookie можуть бути як «стійкими» файлами cookie, так і «сеансовими» файлами cookie: стійкий файл cookie буде зберігатися веб-браузером і залишатиметься дійсним до встановленої дати його закінчення, якщо Ви його не видалили до дати закінчення терміну дії; cookie сеанс, з іншого боку, закінчується в кінці сеансу Вашої роботи, коли веб-браузер закриється. Файли cookie, як правило, не містять будь-якої інформації, яка особисто Вас ідентифікує, але особиста інформація, яку ми зберігаємо про Вас, може бути пов’язана з інформацією, що зберігається та отримується від файлів cookie.',
      '11.2. Назви файлів cookie, які ми використовуємо на нашому Сайті, та цілі, для яких вони використовуються, викладені нижче:',
      'ми використовуємо Google Analytics на нашому Сайті для розпізнавання комп’ютера, коли Користувач відвідує наш Сайт.',
      'Більшість браузерів дозволяють Вам відмовитись від прийняття файлів cookie – наприклад:',
      'в Internet Explorer (версія 10) Ви можете заблокувати файли cookie, використовуючи параметри керування файлами cookie, натиснувши «Інструменти», «Параметри Інтернету», «Конфіденційність», а потім «Додатково»;',
      'у Firefox (версія 24) Ви можете заблокувати всі файли cookie, натиснувши «Інструменти», «Параметри», «Конфіденційність», виберіть зі спадного меню пункт «Використовувати власні налаштування для історії» та зніміть галочку «Прийняти файли cookie з сайтів»; і',
      'у Chrome (версія 29) Ви можете заблокувати всі файли cookie, відкривши меню «Налаштувати та керувати», натиснувши «Налаштування», «Показати розширені налаштування» та «Налаштування вмісту», а потім вибрати «Блокувати сайти з налаштування будь-яких даних» «Під заголовком» Cookies «.',
      '11.3. Блокування всіх файлів cookie негативно вплине на зручність використання Сайту. Якщо Ви заблокуєте файли cookie, Ви не зможете використовувати всі функції нашого Сайту.',
      '11.4. Ви можете видалити файли cookie, які вже зберігаються на вашому комп’ютері. Видалення файлів cookie негативно вплине на зручність використання багатьох веб-сайтів.',
      'Для видалення файлів cookie:',
      'в Internet Explorer (версія 10) потрібно видалити файли cookie вручну (інструкції щодо цього можна знайти на веб-сайті http://support.microsoft.com/kb/278835);',
      'у Firefox (версія 24) Ви можете видалити файли cookie, натиснувши «Інструменти», «Параметри» та «Конфіденційність», потім виберіть «Використовувати власні налаштування для історії», натисніть «Показати файли cookie», а потім натисніть «Видалити всі файли cookie» ; і',
      'у Chrome (версія 29) Ви можете видалити всі файли cookie, відкривши меню «Налаштувати та керувати» та натиснувши «Налаштування», «Показати розширені налаштування» та «Очистити дані веб-перегляду», а потім вибрати «Видалити файли cookie та інший сайт і плагінні дані , перш ніж натиснути» «Очистити дані веб-перегляду»',
    ],
  },
  {
    title: '12. Зміна політики.',
    description: [
      '12.1. Ми залишаємо за собою право публікувати окремі примітки про конфіденційність, а також у будь-який час змінювати та/або доповнювати зміст Політики на власний розсуд.',
      '12.2. У випадку внесення істотних змін до Політики ми розмістимо повідомлення на Сайті та зазначено термін набрання цими змінами чинності. Якщо протягом зазначеного терміну Ви не відмовитеся від прийняття цих змін в письмовій формі, це означатиме, що Ви погодились з відповідними змінами Політики.',
    ],
  },
]

interface ReportType {
  id: number;
  title: string;
  titleImg: string;
  date: string;
  description: string[];
  additionalImg: string[];
  video?: string;
}

export type { ReportType };

const reports: ReportType[] = [
  {
    id: 1,
    title: 'Передали святкове печиво для діток із села Петрівка',
    titleImg: '/report-img.png',
    date: '12.06.2025',
    description: ['Попри війну — життя триває. І наш обов’язок — дарувати дітям радість, тепло й віру в добро. За ініціативи голови благодійної організації «Європейський фонд допомоги» Ніконорова Антона було передано святкове печиво для діток із села Петрівка, Дніпропетровської області.А справжнє свято для малечі організував Червоний Хрест України. Ці усмішки — найкраща нагорода.Вони надихають боротися далі, допомагати ще більше, не зупинятися на шляху до Перемоги. Дякуємо всім, хто поруч у цій великій справі.Разом — ми незламні! Слава Україні! 💙💛'],
    additionalImg: ['/report-img.png', '/report-img.png', '/report-img.png', '/report-img.png', '/report-img.png'],
    video: '/report-video.mp4',
  },
];

export { reports };