import CustomButton from "../../components/ui/customButton";
import { getImagePath } from "../../utils/imagePath";
import './style.css';

const FundHelp = () => {
  return (
    <div className="fund-help">
      <div className="fund-help-title">
        <div className="secondary-text">Допомога</div>
        <h2>Підтримайте нас</h2>
        <div className="fund-help-title-description">
          Нижче Ви можете побачити кнопки, натиснув на які зможете допомогти, тим хто цього потребує. Допомога важлива різна. Ви можете допомогти коштами, можете зробити репост, можете стати частиною нашої команди чи стати нашим партнером.
        </div>
        <CustomButton variant="secondary" className="fund-help-title-button">+ Стати волонтером</CustomButton>
      </div>

      <div className="fund-help-buttons">
        <div className="fund-help-button-container">
          <div className="fund-help-button-container-img">
            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd" d="M11.1771 6.93758C7.9937 6.93758 5.39583 9.53796 5.39583 12.767C5.39583 14.8179 6.59912 16.933 8.49772 19.1301C11.5911 22.7097 15.173 26.4504 18.5 29.5209C21.827 26.4504 25.4089 22.7097 28.5023 19.1301C30.4009 16.933 31.6042 14.8179 31.6042 12.767C31.6042 9.53796 29.0063 6.93758 25.8229 6.93758C24.4474 6.93758 23.1869 7.42004 22.1934 8.22926C21.1451 9.08314 20.5942 9.69658 20.288 10.0725C20.209 10.1695 20.1423 10.2556 20.0814 10.3353C20.0707 10.3492 20.0593 10.3642 20.0473 10.3799C19.9995 10.4426 19.943 10.5168 19.8944 10.5773C19.8421 10.6425 19.7236 10.789 19.5637 10.9226C19.4025 11.0571 19.0174 11.3329 18.4526 11.3218C17.8946 11.3108 17.5239 11.0261 17.3741 10.8947C17.2221 10.7613 17.1088 10.6165 17.0585 10.5518C16.9785 10.4488 16.9359 10.3905 16.8956 10.3355C16.8439 10.2647 16.7961 10.1994 16.6779 10.0516C16.3801 9.67931 15.8408 9.07161 14.8066 8.22926C13.8131 7.42004 12.5525 6.93758 11.1771 6.93758ZM2.3125 12.767C2.3125 7.85417 6.27179 3.85425 11.1771 3.85425C13.2894 3.85425 15.2319 4.599 16.7538 5.83861C17.5187 6.46163 18.0779 6.99718 18.4956 7.44457C18.9161 6.99933 19.4783 6.46406 20.2462 5.83861C21.7681 4.599 23.7106 3.85425 25.8229 3.85425C30.7282 3.85425 34.6875 7.85417 34.6875 12.767C34.6875 15.979 32.8437 18.822 30.8352 21.1461C27.5097 24.9943 23.6255 29.0329 20.0486 32.2836C19.17 33.0821 17.83 33.0821 16.9514 32.2836C13.3745 29.0329 9.49027 24.9943 6.16479 21.1461C4.15633 18.822 2.3125 15.979 2.3125 12.767Z" />
            </svg>
          </div>

          <div className="fund-help-button-container-text">
            <div className="fund-help-button-container-text-title">Грошова підтримка</div>
            <div className="fund-help-button-container-text-description">Ваша фінансова допомога — це реальна можливість забезпечити людей найнеобхіднішим: харчами, ліками, теплом чи безпекою. Донати дозволяють нам швидко реагувати на критичні потреби та масштабувати добрі справи.</div>
          </div>

          <div className="fund-help-button-container-arrow">
            <img src={getImagePath(`/arrow-right-angle.svg`)} alt="arrow-right-angle" />
          </div>
        </div>

        <div className="fund-help-button-container">
          <div className="fund-help-button-container-img">
            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M20.8125 13.1041C20.8125 14.3812 19.7771 15.4166 18.5 15.4166C17.2228 15.4166 16.1875 14.3812 16.1875 13.1041C16.1875 11.8269 17.2228 10.7916 18.5 10.7916C19.7771 10.7916 20.8125 11.8269 20.8125 13.1041Z" fill="#1C9BE9" />
              <path d="M14.6458 26.2083V23.1249H16.9583V20.0416H15.4166V16.9583H18.5C19.3514 16.9583 20.0416 17.6485 20.0416 18.4999V23.1249H22.3541V26.2083H14.6458Z" fill="#1C9BE9" />
              <path fill-rule="evenodd" clip-rule="evenodd" d="M18.5 33.9166C9.98559 33.9166 3.08331 27.0143 3.08331 18.4999C3.08331 9.98553 9.98559 3.08325 18.5 3.08325C27.0144 3.08325 33.9166 9.98553 33.9166 18.4999C33.9166 27.0143 27.0144 33.9166 18.5 33.9166ZM18.5 30.8333C25.3115 30.8333 30.8333 25.3114 30.8333 18.4999C30.8333 11.6884 25.3115 6.16659 18.5 6.16659C11.6885 6.16659 6.16665 11.6884 6.16665 18.4999C6.16665 25.3114 11.6885 30.8333 18.5 30.8333Z" fill="#1C9BE9" />
            </svg>
          </div>

          <div className="fund-help-button-container-text">
            <div className="fund-help-button-container-text-title">Інформаційна підтримка</div>
            <div className="fund-help-button-container-text-description">Інформаційна підтримка — це сила спільноти, яка поширює важливі ініціативи, надихає, розповідає правду та привертає увагу до тих, хто її потребує.</div>
          </div>

          <div className="fund-help-button-container-arrow">
            <img src={getImagePath(`/arrow-right-angle.svg`)} alt="arrow-right-angle" />
          </div>
        </div>

        <div className="fund-help-button-container">
          <div className="fund-help-button-container-img">
            <svg width="37" height="37" viewBox="0 0 37 37" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M21.6126 7.41534C22.9862 6.12496 25.1338 5.80892 26.8142 6.65221L32.0112 9.25146H37V6.16813H32.7388L28.194 3.89417C25.382 2.48663 21.7915 3.00925 19.4975 5.17067L18.5447 6.06792L17.4655 5.08434C16.0487 3.79396 14.2142 3.08325 12.2393 3.08325C11.0507 3.08325 9.86512 3.36384 8.806 3.89263L4.25962 6.16659H0V9.24992H4.98883L10.1873 6.65067C11.7629 5.85825 13.9768 6.07254 15.3889 7.36292L16.2939 8.18771L12.2146 12.0295C10.5604 13.6822 10.2968 16.2953 11.601 18.1006C12.4027 19.2153 13.7578 20.0416 15.3689 20.0416C16.5914 20.0416 17.7646 19.5606 18.6125 18.7111L20.1635 17.2265L29.9423 24.5602L18.5 33.1165L5.13837 23.1249H0V26.2083H4.11163L18.5 36.9675L32.8884 26.2083H37V23.1249H33.1659L22.4205 15.0666L25.0228 12.5753L22.8907 10.3476L16.4573 16.5065C16.1366 16.8272 15.7003 16.9922 15.2425 16.9536C14.783 16.9166 14.3791 16.6838 14.1032 16.2984C13.6807 15.7126 13.8102 14.7953 14.3622 14.2418L21.6126 7.41534Z" fill="#1C9BE9" />
            </svg>
          </div>

          <div className="fund-help-button-container-text">
            <div className="fund-help-button-container-text-title">Партнерство та співробітництво</div>
            <div className="fund-help-button-container-text-description">Ми відкриті до співпраці з волонтерами, благодійниками, бізнесами, громадськими організаціями та ініціативними людьми.</div>
          </div>

          <div className="fund-help-button-container-arrow">
            <img src={getImagePath(`/arrow-right-angle.svg`)} alt="arrow-right-angle" />
          </div>
        </div>
      </div>
    </div>
  )
}

export default FundHelp;